Autodesk.Revit.DB.CurveElement.SetSketchPlaneAndCurve_DontCall(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.Curve)
Sets a new curve and its plane.
Remarks:
Unlike setting either just the sketch plane or just the curve,
this method reestablishes the relationships between those two,
as well as it resets their relationship to other elements.
plane:
New sketch plane.
curve:
New curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.CurveElement.SetTangentLock(System.Int32,Autodesk.Revit.DB.ElementId,System.Boolean)
Sets a new status for an existing tangent join with another curve element at the given end-point.
Remarks:
The input status indicates whether the tangent join is to be locked or unlocked.
Note that the status can be set only if this and the other curve element are currently
joined and tangent at the given point.
Locking a tangent join between elements of a family will make the family parametric.
A parametric family needs to utilize a geometry solver in order to determine final
shapes of its instances. Using the solver in families which contain large sketches
may cause regenerations of such families to become significantly slower.
To determine whether a particular family falls into such a category, programmers
can query Autodesk.Revit.DB.Family.IsParametric property
and Autodesk::Revit::DB::Family::DoesContainLargeSketches()
method of the Autodesk.Revit.DB.Family class.
end:
Index of one of the curve's ends. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
state:
Requested new state of the lock; True to lock it, False to unlock it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id does not represent any of the two end-points of a curve element.
A valid value of either '0' or '1' is expected.
-or-
The given ElementId (%elementId) is not of a valid Curve Element.
A valid Curve Element must be in the same document and must be
diferent than this curve elements self.
-or-
This element has no tangent join with the input element at the given end-point.
-or-
The element other does not exist in the document containing this CurveElement
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This curve element does not support tangent joins with other elements.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This CurveElement is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this CurveElement is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This CurveElement is a member of a group or sketch, and the document
is not currently editing the group or sketch.
-or-
other is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing other is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
other is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2017

Autodesk.Revit.DB.CurveElement.GetTangentLock(System.Int32,Autodesk.Revit.DB.ElementId)
Returns the state of a tangent join between this and another curve element at the given end-point.
Remarks:
The return value indicates whether there is such tangent join and if it is currently locked.
A negative value indicates that there either is no tangent join with the other element
at the given end-point, or the join between those two curve element is not currently locked.
end:
Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
Returns:
Returns True if this curve element has a tangent joint with the other input element and the join is curently locked; returns False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id does not represent any of the two end-points of a curve element.
A valid value of either '0' or '1' is expected.
-or-
The given ElementId (%elementId) is not of a valid Curve Element.
A valid Curve Element must be in the same document and must be
diferent than this curve elements self.
-or-
This element has no tangent join with the input element at the given end-point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.CurveElement.HasTangentLocks(System.Int32)
Tests whether this curve element has any locked tangent joins at the given end-point.
Remarks:
Note that tangent locks between two elements at their joined ends are always kept in
sync with each other. It means that if one curve element is locked to another curve,
the other curve will be automatically locked to the first curve at the shared join.
end:
Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
Returns:
Returns True if the curve element is tangentially locked to at least one other curve element at the given end-point; returns False otherwise.
Since:
2017

Autodesk.Revit.DB.CurveElement.HasTangentJoin(System.Int32,Autodesk.Revit.DB.ElementId)
Tests whether this curve element and the input curve element have common tangent join at the given end-point.
end:
Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
Returns:
Returns True if the two curve elements have a tangent join at the given end-point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.CurveElement.IsAdjoinedCurveElement(System.Int32,Autodesk.Revit.DB.ElementId)
This method tests whether this and the given curve elements are joined at the given end.
Remarks:
The input end is relative to this curve element.
The other curve element can be joined at any of its end-points.
end:
Index of one of the curve's end. Values '0' and '1' indicate the start or end point, respectively.
other:
ElementId of another Curve Element from the same document.
Returns:
Returns True if the input curve element joins This curve element at the given end-point; returns False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id does not represent any of the two end-points of a curve element.
A valid value of either '0' or '1' is expected.
-or-
The given ElementId (%elementId) is not of a valid Curve Element.
A valid Curve Element must be in the same document and must be
diferent than this curve elements self.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.CurveElement.GetAdjoinedCurveElements(System.Int32)
Returns elements that are joining with this curve element at the given end point.
end:
Id of one the curve's end. Value '0' indicates start and '1' indicates the end of the curve, respectively.
Returns:
Collection of Ids of Curve Elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id does not represent any of the two end-points of a curve element.
A valid value of either '0' or '1' is expected.
Since:
2017

Autodesk.Revit.DB.CurveElement.GetLineStyleIds
Ids of all line style Elements that are applicable to this curve element.
Remarks:
The elements are of the Autodesk::Revit::DB::GraphicsStyle class.
Returns:
A collection of Ids of line style elements.

Autodesk.Revit.DB.CurveElement.SupportsTangentLocks
Indicates whether or not this curve element can have a locked tangent
join at either of its end-points shared with another curve element.

Autodesk.Revit.DB.CurveElement.CurveElementType
Type of the curve element.

Autodesk.Revit.DB.CurveElement
Class representing curve elements.
Remarks:
As a base class of several specialized curved elements
(such as ModelCurve, ModelLine, CurveByPoints, etc.)
CurveElement exposes methods and properties of general use
applicable to most kinds of curves.

Autodesk.Revit.DB.CurveElement.LineStyle
The line style of this curve element.
Remarks: The return of this property will be a Autodesk::Revit::DB::GraphicsStyle element.
These graphics styles should be associated to subcategories of the BuiltInCategory OST_Lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed. -- or --
Thrown when fail to get line style.

Autodesk.Revit.DB.CurveElement.SetSketchPlaneAndCurve(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.Curve)
Sets the sketch plane and the curve for this CurveElement.
Remarks:  Unlike the setters of Autodesk.Revit.DB.CurveElement.SketchPlane and Autodesk.Revit.DB.CurveElement.GeometryCurve,
this method will reset relationships between the two properties and with other elements.
To set a geometry curve which belongs to a sketch-based elements, use Autodesk.Revit.DB.CurveElement.GeometryCurve
sketchPlane: The new sketch plane.
curve: The new curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown if the argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the CurveElement is CurveByPoints or belongs to a Path3d element. -- or --
Thrown if the sketch plane is set on a DetailCurve. -- or --
Thrown if the sketch plane is not suitable. -- or --
Thrown if the CurveElement belongs to a sketch-based element. -- or --
Thrown if modifying the sketch plane is not allowed. -- or --
Thrown if the CurveElement cannot be moved out of its sketch plane. -- or --
Thrown if the input curve is of a type different from the current.  -- or --
Thrown if the input curve is bound and the current is not or vice versa.  -- or --
Thrown if the input curve is helical.  -- or --
Thrown if the input curve lies outside of the SketchPlane of the current curve.
Since: 2015

Autodesk.Revit.DB.CurveElement.SketchPlane
The sketch plane the curve element lies in.
Remarks: The new sketch plane must be parallel to the existing sketch plane.  Setting this property
is not permitted for detail curves because they must be placed only on view-specific planes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown if the argument is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the CurveElement is CurveByPoints or belongs to a Path3d element. -- or --
Thrown if the sketch plane is set on a DetailCurve. --or--
Thrown if the sketch plane is not parallel to the existing plane. -- or --
Thrown if the sketch plane is not suitable. -- or --
Thrown if the CurveElement belongs to a sketch-based element. -- or --
Thrown if modifying the sketch plane is not allowed. -- or --
Thrown if the CurveElement cannot be moved out of its sketch plane.

Autodesk.Revit.DB.CurveElement.CenterPointReference
Centerpoint reference of curve element.  Curves such as circles, arcs, ellipses, and partial ellipses support this property.
Remarks: Use this reference property when using the API to dimension between centerpoints of curves.

Autodesk.Revit.DB.CurveElement.SetGeometryCurve(Autodesk.Revit.DB.Curve,System.Boolean)
Sets the geometry of the curve element.
After the curve geometry is set, other nearby curves may join to the new curve geometry.
curve: The new curve.
overrideJoins: An option to specify whether or not existing joins will affect setting the geometry of the CurveElement.
Setting this parameter to false is essentially the same as directly setting the Autodesk.Revit.DB.CurveElement.GeometryCurve property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown if the argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input curve is of a type different from the current.  -- or --
Thrown if the input curve is bound and the current is not or vice versa.  -- or --
Thrown if the input curve is helical.  -- or --
Thrown if the input curve lies outside of the SketchPlane of the current curve and the CurveElement is not CurveByPoints.
Since: 2015

Autodesk.Revit.DB.CurveElement.GeometryCurve
Geometry curve of the curve element.
Remarks: When setting this property, any curves that this curve is currently joined to will affect the result -
the final geometry of this curve and of the joined curves may change.
To avoid the effect of existing joins, use Autodesk.Revit.DB.CurveElement.SetGeometryCurve(Autodesk.Revit.DB.Curve,System.Boolean) with true passed ot overrideJoins.
After the curve geometry is set, other nearby curves may join to the new curve geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown if the argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown if the argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown if the input curve is of a type different from the current.  -- or --
Thrown if the input curve is bound and the current is not or vice versa.  -- or --
Thrown if the input curve is helical.  -- or --
Thrown if the input curve lies outside of the SketchPlane of the current curve and the CurveElement is not CurveByPoints.